docs/contributing.org
#+TITLE: Contributing

* Ground rules
** Be respectful to others
We can achieve great things when we work collaboratively and respectfully.
Remember that all source code must respect the freedom and privacy of others.

** We're all here to collaborate, so let's enjoy it
Through our collaboration in the building of this community, we can achieve awesome things.
By collaborating with one another, we can build an excellent project, which will positively impact other people’s lives.

** Stay awesome
We appreciate all the help which will come from this project, so we greatly thank our contributors.

* Community Agreements

To contribute to this project, please read [the community agreements docs](https://gitlab.com/safesurfer/community/-/blob/master/docs/CONTRIBUTING.md).

* Your first commit
Looking for places to start? A good place is the [issues](https://gitlab.com/safesurfer/minio-file-server/issues) page.
There will likely be a few issues for you to check out and to see if you can resolve.
