docs/contributing.md
- [Ground rules](#sec-1)
  - [Be respectful to others](#sec-1-1)
  - [We're all here to collaborate, so let's enjoy it](#sec-1-2)
  - [Stay awesome](#sec-1-3)
- [Community Agreements](#sec-2)
- [Your first commit](#sec-3)


# Ground rules<a id="sec-1"></a>

## Be respectful to others<a id="sec-1-1"></a>

We can achieve great things when we work collaboratively and respectfully. Remember that all source code must respect the freedom and privacy of others.

## We're all here to collaborate, so let's enjoy it<a id="sec-1-2"></a>

Through our collaboration in the building of this community, we can achieve awesome things. By collaborating with one another, we can build an excellent project, which will positively impact other people’s lives.

## Stay awesome<a id="sec-1-3"></a>

We appreciate all the help which will come from this project, so we greatly thank our contributors.

# Community Agreements<a id="sec-2"></a>

To contribute to this project, please read [the community agreements docs](<https://gitlab.com/safesurfer/community/-/blob/master/docs/CONTRIBUTING.md>).

# Your first commit<a id="sec-3"></a>

Looking for places to start? A good place is the [issues](<https://gitlab.com/safesurfer/minio-file-server/issues>) page. There will likely be a few issues for you to check out and to see if you can resolve.
